var personTree
var rooms
exports = {
	name: "CourseList",
	data() {
		// let arr = Array.from({length:100}, (v, k) => k)
		return {
			list: rooms,
			personTree: personTree
		};
	},
	computed: {
	    courseItems(){
	    	return Object.values(this.$rtc.roomList)
	    }
    },
    mounted() {
    	var setting = {
	        view: {
	            dblClickExpand: false
	        },
	        data: {
	            simpleData: {
	                enable: true
	            }
	        },
	        callback: {
	            onClick: function(){},
	        }
	    }
        $.fn.zTree.init($(this.$refs.personTree), setting, personTree);
    },
	methods: {
		join(roomInfo) {
			$.myZui.form('aaa', '', function(data){
                console.log(data)
                this.$rtc.joinRoom(roomInfo.roomId, roomInfo.roomId, roomInfo.roomName)
				// $ajax('../kshWs/webRTCAction/joinRoom', {
				// 	roomId: roomInfo.roomId,
				// 	roomPwd: '123'
				// }, msg => {
				// 	if (msg) {
				// 		this.$router.push({
				// 			path: 'main',
				// 			query: {
				// 				roomId: roomInfo.roomId
				// 			}
				// 		})
				// 	}
				// })
            })
			return;
		},
		onCreateButtonClick() {
			this.$router.push({
				path: 'create'
			})
		}
	},
	beforeRouteEnter (to, from, next) {
		if (!personTree || !rooms) {
		    // $ajax.all([['../kshWs/webRTCAction/getPersonTree'], ['../kshWs/webRTCAction/getAllRooms']], null, function(getPersonTree, getAllRooms){
		    	var getPersonTree = [{"name":"广州市公安局","pId":"root","id":"440100000000"},{"name":"广州市公安局荔湾区分局","pId":"440100000000","id":"440103000000"},{"name":"广州市公安局越秀区分局","pId":"440100000000","id":"440104000000"},{"name":"广州市公安局海珠区分局","pId":"440100000000","id":"440105000000"},{"name":"广州市公安局天河区分局","pId":"440100000000","id":"440106000000"},{"name":"广州市公安局白云区分局","pId":"440100000000","id":"440111000000"},{"name":"广州市公安局黄埔区分局","pId":"440100000000","id":"440112000000"},{"name":"广州市公安局番禺区分局","pId":"440100000000","id":"440113000000"},{"name":"广州市公安局花都区分局","pId":"440100000000","id":"440114000000"},{"name":"广州市公安局南沙区分局","pId":"440100000000","id":"440115000000"},{"name":"广州市公安局从化区分局","pId":"440100000000","id":"440117000000"},{"name":"广州市公安局增城区分局","pId":"440100000000","id":"440118000000"},{"name":"广州市公安局水上分局","pId":"440100000000","id":"440199000000"},{"name":"韶关市公安局","pId":"root","id":"440200000000"},{"name":"韶关市公安局武江分局","pId":"440200000000","id":"440203000000"},{"name":"韶关市公安局浈江分局","pId":"440200000000","id":"440204000000"},{"name":"韶关市公安局曲江分局","pId":"440200000000","id":"440221000000"},{"name":"始兴县公安局","pId":"440200000000","id":"440222000000"},{"name":"仁化县公安局","pId":"440200000000","id":"440224000000"},{"name":"翁源县公安局","pId":"440200000000","id":"440229000000"},{"name":"乳源瑶族自治县公安局","pId":"440200000000","id":"440232000000"},{"name":"新丰县公安局","pId":"440200000000","id":"440233000000"},{"name":"乐昌市公安局","pId":"440200000000","id":"440281000000"},{"name":"南雄市公安局","pId":"440200000000","id":"440282000000"},{"name":"深圳市公安局","pId":"root","id":"440300000000"},{"name":"深圳市公安局罗湖分局","pId":"440300000000","id":"440303000000"},{"name":"深圳市公安局福田分局","pId":"440300000000","id":"440304000000"},{"name":"深圳市公安局南山分局","pId":"440300000000","id":"440305000000"},{"name":"深圳市公安局宝安分局","pId":"440300000000","id":"440306000000"},{"name":"深圳市公安局龙岗分局","pId":"440300000000","id":"440307000000"},{"name":"深圳市公安局盐田分局","pId":"440300000000","id":"440308000000"},{"name":"深圳市公安局光明分局","pId":"440300000000","id":"440309000000"},{"name":"深圳市公安局坪山分局","pId":"440300000000","id":"440310000000"},{"name":"深圳市公安局龙华分局","pId":"440300000000","id":"440311000000"},{"name":"深圳市公安局大鹏分局","pId":"440300000000","id":"440312000000"},{"name":"深圳市公安局机场分局","pId":"440300000000","id":"440395000000"},{"name":"深圳市公安局公交分局","pId":"440300000000","id":"440396000000"},{"name":"深圳市公安局大亚湾分局","pId":"440300000000","id":"440398000000"},{"name":"深圳市公安局东深分局","pId":"440300000000","id":"440399000000"},{"name":"珠海市公安局","pId":"root","id":"440400000000"},{"name":"珠海市公安局香洲分局","pId":"440400000000","id":"440402000000"},{"name":"珠海市公安局斗门分局","pId":"440400000000","id":"440403000000"},{"name":"珠海市公安局金湾分局","pId":"440400000000","id":"440404000000"},{"name":"珠海市公安局横琴分局","pId":"440400000000","id":"440494000000"},{"name":"珠海市公安局高新分局","pId":"440400000000","id":"440496000000"},{"name":"珠海市公安局高栏港分局","pId":"440400000000","id":"440497000000"},{"name":"珠海市公安局机场分局","pId":"440400000000","id":"440498000000"},{"name":"珠海市公安局拱北口岸分局","pId":"440400000000","id":"440499000000"},{"name":"汕头市公安局","pId":"root","id":"440500000000"},{"name":"汕头市公安局龙湖分局","pId":"440500000000","id":"440507000000"},{"name":"汕头市公安局金平分局","pId":"440500000000","id":"440511000000"},{"name":"汕头市公安局濠江分局","pId":"440500000000","id":"440512000000"},{"name":"汕头市公安局潮阳分局","pId":"440500000000","id":"440513000000"},{"name":"汕头市公安局潮南分局","pId":"440500000000","id":"440514000000"},{"name":"汕头市公安局澄海分局","pId":"440500000000","id":"440515000000"},{"name":"南澳县公安局","pId":"440500000000","id":"440523000000"},{"name":"佛山市公安局","pId":"root","id":"440600000000"},{"name":"佛山市公安局禅城分局","pId":"440600000000","id":"440604000000"},{"name":"佛山市公安局南海分局","pId":"440600000000","id":"440605000000"},{"name":"佛山市顺德区公安局","pId":"440600000000","id":"440606000000"},{"name":"佛山市公安局三水分局","pId":"440600000000","id":"440607000000"},{"name":"佛山市公安局高明分局","pId":"440600000000","id":"440608000000"},{"name":"江门市公安局","pId":"root","id":"440700000000"},{"name":"江门市公安局蓬江分局","pId":"440700000000","id":"440703000000"},{"name":"江门市公安局江海分局","pId":"440700000000","id":"440704000000"},{"name":"江门市公安局新会分局","pId":"440700000000","id":"440705000000"},{"name":"台山市公安局","pId":"440700000000","id":"440781000000"},{"name":"开平市公安局","pId":"440700000000","id":"440783000000"},{"name":"鹤山市公安局","pId":"440700000000","id":"440784000000"},{"name":"恩平市公安局","pId":"440700000000","id":"440785000000"},{"name":"湛江市公安局","pId":"root","id":"440800000000"},{"name":"湛江市公安局赤坎分局","pId":"440800000000","id":"440802000000"},{"name":"湛江市公安局霞山分局","pId":"440800000000","id":"440803000000"},{"name":"湛江市公安局坡头分局","pId":"440800000000","id":"440804000000"},{"name":"湛江市公安局麻章分局","pId":"440800000000","id":"440811000000"},{"name":"遂溪县公安局","pId":"440800000000","id":"440823000000"},{"name":"徐闻县公安局","pId":"440800000000","id":"440825000000"},{"name":"廉江市公安局","pId":"440800000000","id":"440881000000"},{"name":"雷州市公安局","pId":"440800000000","id":"440882000000"},{"name":"吴川市公安局","pId":"440800000000","id":"440883000000"},{"name":"湛江市公安局南三分局","pId":"440800000000","id":"440895000000"},{"name":"湛江市公安局奋勇经济区分局","pId":"440800000000","id":"440896000000"},{"name":"湛江市公安局海东分局","pId":"440800000000","id":"440897000000"},{"name":"湛江市公安局经济技术开发区分局","pId":"440800000000","id":"440899000000"},{"name":"茂名市公安局","pId":"root","id":"440900000000"},{"name":"茂名市公安局茂南分局","pId":"440900000000","id":"440902000000"},{"name":"茂名市公安局电白分局","pId":"440900000000","id":"440905000000"},{"name":"茂名市公安局大数据中心","pId":"440900000000","id":"440931000000"},{"name":"高州市公安局","pId":"440900000000","id":"440981000000"},{"name":"化州市公安局","pId":"440900000000","id":"440982000000"},{"name":"信宜市公安局","pId":"440900000000","id":"440983000000"},{"name":"茂名市公安局滨海新区分局","pId":"440900000000","id":"440998000000"},{"name":"茂名市公安局高新技术产业开发区分局","pId":"440900000000","id":"440999000000"},{"name":"肇庆市公安局","pId":"root","id":"441200000000"},{"name":"肇庆市公安局端州分局","pId":"441200000000","id":"441202000000"},{"name":"肇庆市公安局鼎湖分局","pId":"441200000000","id":"441203000000"},{"name":"肇庆市公安局大旺分局","pId":"441200000000","id":"441204000000"},{"name":"广宁县公安局","pId":"441200000000","id":"441223000000"},{"name":"怀集县公安局","pId":"441200000000","id":"441224000000"},{"name":"封开县公安局","pId":"441200000000","id":"441225000000"},{"name":"德庆县公安局","pId":"441200000000","id":"441226000000"},{"name":"肇庆市公安局高要分局","pId":"441200000000","id":"441283000000"},{"name":"四会市公安局","pId":"441200000000","id":"441284000000"},{"name":"惠州市公安局","pId":"root","id":"441300000000"},{"name":"惠州市公安局惠城区分局","pId":"441300000000","id":"441302000000"},{"name":"惠州市博罗县公安局","pId":"441300000000","id":"441322000000"},{"name":"惠州市惠东县公安局","pId":"441300000000","id":"441323000000"},{"name":"惠州市龙门县公安局","pId":"441300000000","id":"441324000000"},{"name":"惠州市公安局仲恺高新开发区分局","pId":"441300000000","id":"441330000000"},{"name":"惠州市公安局惠阳区分局","pId":"441300000000","id":"441381000000"},{"name":"惠州市大亚湾经济技术开发区公安局","pId":"441300000000","id":"441399000000"},{"name":"梅州市公安局","pId":"root","id":"441400000000"},{"name":"梅州市公安局梅江分局","pId":"441400000000","id":"441402000000"},{"name":"梅州市公安局梅县区分局","pId":"441400000000","id":"441421000000"},{"name":"大埔县公安局","pId":"441400000000","id":"441422000000"},{"name":"丰顺县公安局","pId":"441400000000","id":"441423000000"},{"name":"五华县公安局","pId":"441400000000","id":"441424000000"},{"name":"平远县公安局","pId":"441400000000","id":"441426000000"},{"name":"蕉岭县公安局","pId":"441400000000","id":"441427000000"},{"name":"兴宁市公安局","pId":"441400000000","id":"441481000000"},{"name":"汕尾市公安局","pId":"root","id":"441500000000"},{"name":"汕尾市公安局城区分局","pId":"441500000000","id":"441502000000"},{"name":"海丰县公安局","pId":"441500000000","id":"441521000000"},{"name":"陆河县公安局","pId":"441500000000","id":"441523000000"},{"name":"陆丰市公安局","pId":"441500000000","id":"441581000000"},{"name":"汕尾市公安局红海湾分局","pId":"441500000000","id":"441598000000"},{"name":"汕尾市公安局尖山分局","pId":"441500000000","id":"441599000000"},{"name":"河源市公安局","pId":"root","id":"441600000000"},{"name":"河源市公安局源城分局","pId":"441600000000","id":"441602000000"},{"name":"紫金县公安局","pId":"441600000000","id":"441621000000"},{"name":"龙川县公安局","pId":"441600000000","id":"441622000000"},{"name":"连平县公安局","pId":"441600000000","id":"441623000000"},{"name":"和平县公安局","pId":"441600000000","id":"441624000000"},{"name":"东源县公安局","pId":"441600000000","id":"441625000000"},{"name":"河源市公安局江东分局","pId":"441600000000","id":"441699000000"},{"name":"阳江市公安局","pId":"root","id":"441700000000"},{"name":"阳江市公安局江城分局","pId":"441700000000","id":"441702000000"},{"name":"阳西县公安局","pId":"441700000000","id":"441721000000"},{"name":"阳江市公安局阳东分局","pId":"441700000000","id":"441723000000"},{"name":"阳春市公安局","pId":"441700000000","id":"441781000000"},{"name":"阳江市公安局高新分局","pId":"441700000000","id":"441798000000"},{"name":"阳江市公安局海陵分局","pId":"441700000000","id":"441799000000"},{"name":"清远市公安局","pId":"root","id":"441800000000"},{"name":"清远市公安局清城分局","pId":"441800000000","id":"441802000000"},{"name":"佛冈县公安局","pId":"441800000000","id":"441821000000"},{"name":"阳山县公安局","pId":"441800000000","id":"441823000000"},{"name":"连山壮族瑶族自治县公安局","pId":"441800000000","id":"441825000000"},{"name":"连南瑶族自治县公安局","pId":"441800000000","id":"441826000000"},{"name":"清远市公安局清新分局","pId":"441800000000","id":"441827000000"},{"name":"英德市公安局","pId":"441800000000","id":"441881000000"},{"name":"连州市公安局","pId":"441800000000","id":"441882000000"},{"name":"东莞市公安局","pId":"root","id":"441900000000"},{"name":"东莞市公安局森林分局","pId":"441900000000","id":"441983000000"},{"name":"中山市公安局","pId":"root","id":"442000000000"},{"name":"石岐区分局","pId":"442000000000","id":"442050000000"},{"name":"火炬开发区分局","pId":"442000000000","id":"442051000000"},{"name":"小榄分局","pId":"442000000000","id":"442052000000"},{"name":"东区分局","pId":"442000000000","id":"442053000000"},{"name":"西区分局","pId":"442000000000","id":"442054000000"},{"name":"黄圃分局","pId":"442000000000","id":"442055000000"},{"name":"三乡分局","pId":"442000000000","id":"442056000000"},{"name":"南朗分局","pId":"442000000000","id":"442057000000"},{"name":"沙溪分局","pId":"442000000000","id":"442058000000"},{"name":"坦洲分局","pId":"442000000000","id":"442059000000"},{"name":"南区分局","pId":"442000000000","id":"442060000000"},{"name":"港口分局","pId":"442000000000","id":"442061000000"},{"name":"东升分局","pId":"442000000000","id":"442062000000"},{"name":"东凤分局","pId":"442000000000","id":"442063000000"},{"name":"古镇分局","pId":"442000000000","id":"442064000000"},{"name":"民众分局","pId":"442000000000","id":"442065000000"},{"name":"板芙分局","pId":"442000000000","id":"442066000000"},{"name":"三角分局","pId":"442000000000","id":"442067000000"},{"name":"大涌分局","pId":"442000000000","id":"442068000000"},{"name":"横栏分局","pId":"442000000000","id":"442069000000"},{"name":"南头分局","pId":"442000000000","id":"442070000000"},{"name":"五桂山分局","pId":"442000000000","id":"442071000000"},{"name":"阜沙分局","pId":"442000000000","id":"442072000000"},{"name":"神湾分局","pId":"442000000000","id":"442073000000"},{"name":"森林分局","pId":"442000000000","id":"442074000000"},{"name":"潮州市公安局","pId":"root","id":"445100000000"},{"name":"潮州市公安局湘桥分局","pId":"445100000000","id":"445102000000"},{"name":"潮州市公安局潮安分局","pId":"445100000000","id":"445121000000"},{"name":"饶平县公安局","pId":"445100000000","id":"445122000000"},{"name":"潮州市公安局森林分局","pId":"445100000000","id":"445192000000"},{"name":"饶平县公安局森林分局","pId":"445100000000","id":"445194000000"},{"name":"潮州市公安局水上分局","pId":"445100000000","id":"445197000000"},{"name":"潮州市公安局经济开发区分局","pId":"445100000000","id":"445198000000"},{"name":"潮州市公安局枫溪分局","pId":"445100000000","id":"445199000000"},{"name":"揭阳市公安局","pId":"root","id":"445200000000"},{"name":"揭阳市公安局榕城分局","pId":"445200000000","id":"445202000000"},{"name":"揭阳市公安局揭东分局","pId":"445200000000","id":"445221000000"},{"name":"揭西县公安局","pId":"445200000000","id":"445222000000"},{"name":"惠来县公安局","pId":"445200000000","id":"445224000000"},{"name":"揭阳市公安局普华分局","pId":"445200000000","id":"445225000000"},{"name":"揭阳市公安局大南山分局","pId":"445200000000","id":"445226000000"},{"name":"揭阳市公安局大南海分局","pId":"445200000000","id":"445227000000"},{"name":"普宁市公安局","pId":"445200000000","id":"445281000000"},{"name":"揭阳市公安局空港分局","pId":"445200000000","id":"445298000000"},{"name":"揭阳市公安局蓝城分局","pId":"445200000000","id":"445299000000"},{"name":"云浮市公安局","pId":"root","id":"445300000000"},{"name":"云浮市公安局云城分局","pId":"445300000000","id":"445302000000"},{"name":"云浮市公安局云安分局","pId":"445300000000","id":"445303000000"},{"name":"新兴县公安局","pId":"445300000000","id":"445321000000"},{"name":"郁南县公安局","pId":"445300000000","id":"445322000000"},{"name":"罗定市公安局","pId":"445300000000","id":"445381000000"}]
		    	var getAllRooms = []
		    	personTree = getPersonTree
		    	rooms = getAllRooms
		    	next()
		    // })
		    return
		}
		next()
	},
};